OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1789.h
extern __at(0x0E93) volatile __PSMC1SYNCbits_t PSMC1SYNCbits;

#define _P1SYNC0                0x01
#define _P1SYNC1                0x02
#define _P1SYNC2                0x04
#define _P1DCPOL                0x20
#define _P1PRPOL                0x40
#define _P1POFST                0x80

//==============================================================================


//==============================================================================
//        PSMC1CLK Bits

extern __at(0x0E94) __sfr PSMC1CLK;

typedef union
  {
  struct
    {
    unsigned P1CSRC0            : 1;
    unsigned P1CSRC1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P1CPRE0            : 1;
    unsigned P1CPRE1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P1CSRC             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P1CPRE             : 2;
    unsigned                    : 2;
    };
  } __PSMC1CLKbits_t;

extern __at(0x0E94) volatile __PSMC1CLKbits_t PSMC1CLKbits;

#define _P1CSRC0                0x01
#define _P1CSRC1                0x02
#define _P1CPRE0                0x10
#define _P1CPRE1                0x20

//==============================================================================


//==============================================================================
//        PSMC1OEN Bits

extern __at(0x0E95) __sfr PSMC1OEN;

typedef struct
  {
  unsigned P1OEA                : 1;
  unsigned P1OEB                : 1;
  unsigned P1OEC                : 1;
  unsigned P1OED                : 1;
  unsigned P1OEE                : 1;
  unsigned P1OEF                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC1OENbits_t;

extern __at(0x0E95) volatile __PSMC1OENbits_t PSMC1OENbits;

#define _P1OEA                  0x01
#define _P1OEB                  0x02
#define _P1OEC                  0x04
#define _P1OED                  0x08
#define _P1OEE                  0x10
#define _P1OEF                  0x20

//==============================================================================


//==============================================================================
//        PSMC1POL Bits

extern __at(0x0E96) __sfr PSMC1POL;

typedef struct
  {
  unsigned P1POLA               : 1;
  unsigned P1POLB               : 1;
  unsigned P1POLC               : 1;
  unsigned P1POLD               : 1;
  unsigned P1POLE               : 1;
  unsigned P1POLF               : 1;
  unsigned P1INPOL              : 1;
  unsigned                      : 1;
  } __PSMC1POLbits_t;

extern __at(0x0E96) volatile __PSMC1POLbits_t PSMC1POLbits;

#define _P1POLA                 0x01
#define _P1POLB                 0x02
#define _P1POLC                 0x04
#define _P1POLD                 0x08
#define _P1POLE                 0x10
#define _P1POLF                 0x20
#define _P1INPOL                0x40

//==============================================================================


//==============================================================================
//        PSMC1BLNK Bits

extern __at(0x0E97) __sfr PSMC1BLNK;

typedef union
  {
  struct
    {
    unsigned P1REBM0            : 1;
    unsigned P1REBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P1FEBM0            : 1;
    unsigned P1FEBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P1REBM             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P1FEBM             : 2;
    unsigned                    : 2;
    };
  } __PSMC1BLNKbits_t;

extern __at(0x0E97) volatile __PSMC1BLNKbits_t PSMC1BLNKbits;

#define _P1REBM0                0x01
#define _P1REBM1                0x02
#define _P1FEBM0                0x10
#define _P1FEBM1                0x20

//==============================================================================


//==============================================================================
//        PSMC1REBS Bits

extern __at(0x0E98) __sfr PSMC1REBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P1REBSC1             : 1;
  unsigned P1REBSC2             : 1;
  unsigned P1REBSC3             : 1;
  unsigned P1REBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1REBSIN             : 1;
  } __PSMC1REBSbits_t;

extern __at(0x0E98) volatile __PSMC1REBSbits_t PSMC1REBSbits;

#define _P1REBSC1               0x02
#define _P1REBSC2               0x04
#define _P1REBSC3               0x08
#define _P1REBSC4               0x10
#define _P1REBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC1FEBS Bits

extern __at(0x0E99) __sfr PSMC1FEBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P1FEBSC1             : 1;
  unsigned P1FEBSC2             : 1;
  unsigned P1FEBSC3             : 1;
  unsigned P1FEBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1FEBSIN             : 1;
  } __PSMC1FEBSbits_t;

extern __at(0x0E99) volatile __PSMC1FEBSbits_t PSMC1FEBSbits;

#define _P1FEBSC1               0x02
#define _P1FEBSC2               0x04
#define _P1FEBSC3               0x08
#define _P1FEBSC4               0x10
#define _P1FEBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC1PHS Bits

extern __at(0x0E9A) __sfr PSMC1PHS;

typedef struct
  {
  unsigned P1PHST               : 1;
  unsigned P1PHSC1              : 1;
  unsigned P1PHSC2              : 1;
  unsigned P1PHSC3              : 1;
  unsigned P1PHSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1PHSIN              : 1;
  } __PSMC1PHSbits_t;

extern __at(0x0E9A) volatile __PSMC1PHSbits_t PSMC1PHSbits;

