OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1789.h
extern __at(0x0EC4) __sfr PSMC2DCH;

typedef struct
  {
  unsigned PSMC2DC8             : 1;
  unsigned PSMC2DC9             : 1;
  unsigned PSMC2DC10            : 1;
  unsigned PSMC2DC11            : 1;
  unsigned PSMC2DC12            : 1;
  unsigned PSMC2DC13            : 1;
  unsigned PSMC2DC14            : 1;
  unsigned PSMC2DC15            : 1;
  } __PSMC2DCHbits_t;

extern __at(0x0EC4) volatile __PSMC2DCHbits_t PSMC2DCHbits;

#define _PSMC2DC8               0x01
#define _PSMC2DC9               0x02
#define _PSMC2DC10              0x04
#define _PSMC2DC11              0x08
#define _PSMC2DC12              0x10
#define _PSMC2DC13              0x20
#define _PSMC2DC14              0x40
#define _PSMC2DC15              0x80

//==============================================================================

extern __at(0x0EC5) __sfr PSMC2PR;

//==============================================================================
//        PSMC2PRL Bits

extern __at(0x0EC5) __sfr PSMC2PRL;

typedef struct
  {
  unsigned PSMC2PR0             : 1;
  unsigned PSMC2PR1             : 1;
  unsigned PSMC2PR2             : 1;
  unsigned PSMC2PR3             : 1;
  unsigned PSMC2PR4             : 1;
  unsigned PSMC2PR5             : 1;
  unsigned PSMC2PR6             : 1;
  unsigned PSMC2PR7             : 1;
  } __PSMC2PRLbits_t;

extern __at(0x0EC5) volatile __PSMC2PRLbits_t PSMC2PRLbits;

#define _PSMC2PR0               0x01
#define _PSMC2PR1               0x02
#define _PSMC2PR2               0x04
#define _PSMC2PR3               0x08
#define _PSMC2PR4               0x10
#define _PSMC2PR5               0x20
#define _PSMC2PR6               0x40
#define _PSMC2PR7               0x80

//==============================================================================


//==============================================================================
//        PSMC2PRH Bits

extern __at(0x0EC6) __sfr PSMC2PRH;

typedef struct
  {
  unsigned PSMC2PR8             : 1;
  unsigned PSMC2PR9             : 1;
  unsigned PSMC2PR10            : 1;
  unsigned PSMC2PR11            : 1;
  unsigned PSMC2PR12            : 1;
  unsigned PSMC2PR13            : 1;
  unsigned PSMC2PR14            : 1;
  unsigned PSMC2PR15            : 1;
  } __PSMC2PRHbits_t;

extern __at(0x0EC6) volatile __PSMC2PRHbits_t PSMC2PRHbits;

#define _PSMC2PR8               0x01
#define _PSMC2PR9               0x02
#define _PSMC2PR10              0x04
#define _PSMC2PR11              0x08
#define _PSMC2PR12              0x10
#define _PSMC2PR13              0x20
#define _PSMC2PR14              0x40
#define _PSMC2PR15              0x80

//==============================================================================

extern __at(0x0EC7) __sfr PSMC2TMR;

//==============================================================================
//        PSMC2TMRL Bits

extern __at(0x0EC7) __sfr PSMC2TMRL;

typedef struct
  {
  unsigned PSMC2TMR0            : 1;
  unsigned PSMC2TMR1            : 1;
  unsigned PSMC2TMR2            : 1;
  unsigned PSMC2TMR3            : 1;
  unsigned PSMC2TMR4            : 1;
  unsigned PSMC2TMR5            : 1;
  unsigned PSMC2TMR6            : 1;
  unsigned PSMC2TMR7            : 1;
  } __PSMC2TMRLbits_t;

extern __at(0x0EC7) volatile __PSMC2TMRLbits_t PSMC2TMRLbits;

#define _PSMC2TMR0              0x01
#define _PSMC2TMR1              0x02
#define _PSMC2TMR2              0x04
#define _PSMC2TMR3              0x08
#define _PSMC2TMR4              0x10
#define _PSMC2TMR5              0x20
#define _PSMC2TMR6              0x40
#define _PSMC2TMR7              0x80

//==============================================================================


//==============================================================================
//        PSMC2TMRH Bits

extern __at(0x0EC8) __sfr PSMC2TMRH;

typedef struct
  {
  unsigned PSMC2TMR8            : 1;
  unsigned PSMC2TMR9            : 1;
  unsigned PSMC2TMR10           : 1;
  unsigned PSMC2TMR11           : 1;
  unsigned PSMC2TMR12           : 1;
  unsigned PSMC2TMR13           : 1;
  unsigned PSMC2TMR14           : 1;
  unsigned PSMC2TMR15           : 1;
  } __PSMC2TMRHbits_t;

extern __at(0x0EC8) volatile __PSMC2TMRHbits_t PSMC2TMRHbits;

#define _PSMC2TMR8              0x01
#define _PSMC2TMR9              0x02
#define _PSMC2TMR10             0x04
#define _PSMC2TMR11             0x08
#define _PSMC2TMR12             0x10
#define _PSMC2TMR13             0x20
#define _PSMC2TMR14             0x40
#define _PSMC2TMR15             0x80

//==============================================================================


//==============================================================================
//        PSMC2DBR Bits

extern __at(0x0EC9) __sfr PSMC2DBR;

typedef struct
  {
  unsigned PSMC2DBR0            : 1;
  unsigned PSMC2DBR1            : 1;
  unsigned PSMC2DBR2            : 1;
  unsigned PSMC2DBR3            : 1;
  unsigned PSMC2DBR4            : 1;
  unsigned PSMC2DBR5            : 1;
  unsigned PSMC2DBR6            : 1;
  unsigned PSMC2DBR7            : 1;
  } __PSMC2DBRbits_t;

extern __at(0x0EC9) volatile __PSMC2DBRbits_t PSMC2DBRbits;

#define _PSMC2DBR0              0x01
#define _PSMC2DBR1              0x02
#define _PSMC2DBR2              0x04
#define _PSMC2DBR3              0x08
#define _PSMC2DBR4              0x10
#define _PSMC2DBR5              0x20
#define _PSMC2DBR6              0x40
#define _PSMC2DBR7              0x80

//==============================================================================


//==============================================================================
//        PSMC2DBF Bits

extern __at(0x0ECA) __sfr PSMC2DBF;

typedef struct
  {
  unsigned PSMC2DBF0            : 1;
  unsigned PSMC2DBF1            : 1;
  unsigned PSMC2DBF2            : 1;
  unsigned PSMC2DBF3            : 1;
  unsigned PSMC2DBF4            : 1;
  unsigned PSMC2DBF5            : 1;
  unsigned PSMC2DBF6            : 1;
  unsigned PSMC2DBF7            : 1;
  } __PSMC2DBFbits_t;

extern __at(0x0ECA) volatile __PSMC2DBFbits_t PSMC2DBFbits;

