OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1789.h
extern __at(0x0EE3) __sfr PSMC3DC;

//==============================================================================
//        PSMC3DCL Bits

extern __at(0x0EE3) __sfr PSMC3DCL;

typedef struct
  {
  unsigned PSMC3DC0             : 1;
  unsigned PSMC3DC1             : 1;
  unsigned PSMC3DC2             : 1;
  unsigned PSMC3DC3             : 1;
  unsigned PSMC3DC4             : 1;
  unsigned PSMC3DC5             : 1;
  unsigned PSMC3DC6             : 1;
  unsigned PSMC3DC7             : 1;
  } __PSMC3DCLbits_t;

extern __at(0x0EE3) volatile __PSMC3DCLbits_t PSMC3DCLbits;

#define _PSMC3DC0               0x01
#define _PSMC3DC1               0x02
#define _PSMC3DC2               0x04
#define _PSMC3DC3               0x08
#define _PSMC3DC4               0x10
#define _PSMC3DC5               0x20
#define _PSMC3DC6               0x40
#define _PSMC3DC7               0x80

//==============================================================================


//==============================================================================
//        PSMC3DCH Bits

extern __at(0x0EE4) __sfr PSMC3DCH;

typedef struct
  {
  unsigned PSMC3DC8             : 1;
  unsigned PSMC3DC9             : 1;
  unsigned PSMC3DC10            : 1;
  unsigned PSMC3DC11            : 1;
  unsigned PSMC3DC12            : 1;
  unsigned PSMC3DC13            : 1;
  unsigned PSMC3DC14            : 1;
  unsigned PSMC3DC15            : 1;
  } __PSMC3DCHbits_t;

extern __at(0x0EE4) volatile __PSMC3DCHbits_t PSMC3DCHbits;

#define _PSMC3DC8               0x01
#define _PSMC3DC9               0x02
#define _PSMC3DC10              0x04
#define _PSMC3DC11              0x08
#define _PSMC3DC12              0x10
#define _PSMC3DC13              0x20
#define _PSMC3DC14              0x40
#define _PSMC3DC15              0x80

//==============================================================================

extern __at(0x0EE5) __sfr PSMC3PR;

//==============================================================================
//        PSMC3PRL Bits

extern __at(0x0EE5) __sfr PSMC3PRL;

typedef struct
  {
  unsigned PSMC3PR0             : 1;
  unsigned PSMC3PR1             : 1;
  unsigned PSMC3PR2             : 1;
  unsigned PSMC3PR3             : 1;
  unsigned PSMC3PR4             : 1;
  unsigned PSMC3PR5             : 1;
  unsigned PSMC3PR6             : 1;
  unsigned PSMC3PR7             : 1;
  } __PSMC3PRLbits_t;

extern __at(0x0EE5) volatile __PSMC3PRLbits_t PSMC3PRLbits;

#define _PSMC3PR0               0x01
#define _PSMC3PR1               0x02
#define _PSMC3PR2               0x04
#define _PSMC3PR3               0x08
#define _PSMC3PR4               0x10
#define _PSMC3PR5               0x20
#define _PSMC3PR6               0x40
#define _PSMC3PR7               0x80

//==============================================================================


//==============================================================================
//        PSMC3PRH Bits

extern __at(0x0EE6) __sfr PSMC3PRH;

typedef struct
  {
  unsigned PSMC3PR8             : 1;
  unsigned PSMC3PR9             : 1;
  unsigned PSMC3PR10            : 1;
  unsigned PSMC3PR11            : 1;
  unsigned PSMC3PR12            : 1;
  unsigned PSMC3PR13            : 1;
  unsigned PSMC3PR14            : 1;
  unsigned PSMC3PR15            : 1;
  } __PSMC3PRHbits_t;

extern __at(0x0EE6) volatile __PSMC3PRHbits_t PSMC3PRHbits;

#define _PSMC3PR8               0x01
#define _PSMC3PR9               0x02
#define _PSMC3PR10              0x04
#define _PSMC3PR11              0x08
#define _PSMC3PR12              0x10
#define _PSMC3PR13              0x20
#define _PSMC3PR14              0x40
#define _PSMC3PR15              0x80

//==============================================================================

extern __at(0x0EE7) __sfr PSMC3TMR;

//==============================================================================
//        PSMC3TMRL Bits

extern __at(0x0EE7) __sfr PSMC3TMRL;

typedef struct
  {
  unsigned PSMC3TMR0            : 1;
  unsigned PSMC3TMR1            : 1;
  unsigned PSMC3TMR2            : 1;
  unsigned PSMC3TMR3            : 1;
  unsigned PSMC3TMR4            : 1;
  unsigned PSMC3TMR5            : 1;
  unsigned PSMC3TMR6            : 1;
  unsigned PSMC3TMR7            : 1;
  } __PSMC3TMRLbits_t;

extern __at(0x0EE7) volatile __PSMC3TMRLbits_t PSMC3TMRLbits;

#define _PSMC3TMR0              0x01
#define _PSMC3TMR1              0x02
#define _PSMC3TMR2              0x04
#define _PSMC3TMR3              0x08
#define _PSMC3TMR4              0x10
#define _PSMC3TMR5              0x20
#define _PSMC3TMR6              0x40
#define _PSMC3TMR7              0x80

//==============================================================================


//==============================================================================
//        PSMC3TMRH Bits

extern __at(0x0EE8) __sfr PSMC3TMRH;

typedef struct
  {
  unsigned PSMC3TMR8            : 1;
  unsigned PSMC3TMR9            : 1;
  unsigned PSMC3TMR10           : 1;
  unsigned PSMC3TMR11           : 1;
  unsigned PSMC3TMR12           : 1;
  unsigned PSMC3TMR13           : 1;
  unsigned PSMC3TMR14           : 1;
  unsigned PSMC3TMR15           : 1;
  } __PSMC3TMRHbits_t;

extern __at(0x0EE8) volatile __PSMC3TMRHbits_t PSMC3TMRHbits;

#define _PSMC3TMR8              0x01
#define _PSMC3TMR9              0x02
#define _PSMC3TMR10             0x04
#define _PSMC3TMR11             0x08
#define _PSMC3TMR12             0x10
#define _PSMC3TMR13             0x20
#define _PSMC3TMR14             0x40
#define _PSMC3TMR15             0x80

//==============================================================================


//==============================================================================
//        PSMC3DBR Bits

extern __at(0x0EE9) __sfr PSMC3DBR;

typedef struct
  {
  unsigned PSMC3DBR0            : 1;
  unsigned PSMC3DBR1            : 1;
  unsigned PSMC3DBR2            : 1;
  unsigned PSMC3DBR3            : 1;
  unsigned PSMC3DBR4            : 1;
  unsigned PSMC3DBR5            : 1;
  unsigned PSMC3DBR6            : 1;
  unsigned PSMC3DBR7            : 1;
  } __PSMC3DBRbits_t;

extern __at(0x0EE9) volatile __PSMC3DBRbits_t PSMC3DBRbits;

