OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1789.h
#define _PSMC3DBR0              0x01
#define _PSMC3DBR1              0x02
#define _PSMC3DBR2              0x04
#define _PSMC3DBR3              0x08
#define _PSMC3DBR4              0x10
#define _PSMC3DBR5              0x20
#define _PSMC3DBR6              0x40
#define _PSMC3DBR7              0x80

//==============================================================================


//==============================================================================
//        PSMC3DBF Bits

extern __at(0x0EEA) __sfr PSMC3DBF;

typedef struct
  {
  unsigned PSMC3DBF0            : 1;
  unsigned PSMC3DBF1            : 1;
  unsigned PSMC3DBF2            : 1;
  unsigned PSMC3DBF3            : 1;
  unsigned PSMC3DBF4            : 1;
  unsigned PSMC3DBF5            : 1;
  unsigned PSMC3DBF6            : 1;
  unsigned PSMC3DBF7            : 1;
  } __PSMC3DBFbits_t;

extern __at(0x0EEA) volatile __PSMC3DBFbits_t PSMC3DBFbits;

#define _PSMC3DBF0              0x01
#define _PSMC3DBF1              0x02
#define _PSMC3DBF2              0x04
#define _PSMC3DBF3              0x08
#define _PSMC3DBF4              0x10
#define _PSMC3DBF5              0x20
#define _PSMC3DBF6              0x40
#define _PSMC3DBF7              0x80

//==============================================================================


//==============================================================================
//        PSMC3BLKR Bits

extern __at(0x0EEB) __sfr PSMC3BLKR;

typedef struct
  {
  unsigned PSMC3BLKR0           : 1;
  unsigned PSMC3BLKR1           : 1;
  unsigned PSMC3BLKR2           : 1;
  unsigned PSMC3BLKR3           : 1;
  unsigned PSMC3BLKR4           : 1;
  unsigned PSMC3BLKR5           : 1;
  unsigned PSMC3BLKR6           : 1;
  unsigned PSMC3BLKR7           : 1;
  } __PSMC3BLKRbits_t;

extern __at(0x0EEB) volatile __PSMC3BLKRbits_t PSMC3BLKRbits;

#define _PSMC3BLKR0             0x01
#define _PSMC3BLKR1             0x02
#define _PSMC3BLKR2             0x04
#define _PSMC3BLKR3             0x08
#define _PSMC3BLKR4             0x10
#define _PSMC3BLKR5             0x20
#define _PSMC3BLKR6             0x40
#define _PSMC3BLKR7             0x80

//==============================================================================


//==============================================================================
//        PSMC3BLKF Bits

extern __at(0x0EEC) __sfr PSMC3BLKF;

typedef struct
  {
  unsigned PSMC3BLKF0           : 1;
  unsigned PSMC3BLKF1           : 1;
  unsigned PSMC3BLKF2           : 1;
  unsigned PSMC3BLKF3           : 1;
  unsigned PSMC3BLKF4           : 1;
  unsigned PSMC3BLKF5           : 1;
  unsigned PSMC3BLKF6           : 1;
  unsigned PSMC3BLKF7           : 1;
  } __PSMC3BLKFbits_t;

extern __at(0x0EEC) volatile __PSMC3BLKFbits_t PSMC3BLKFbits;

#define _PSMC3BLKF0             0x01
#define _PSMC3BLKF1             0x02
#define _PSMC3BLKF2             0x04
#define _PSMC3BLKF3             0x08
#define _PSMC3BLKF4             0x10
#define _PSMC3BLKF5             0x20
#define _PSMC3BLKF6             0x40
#define _PSMC3BLKF7             0x80

//==============================================================================


//==============================================================================
//        PSMC3FFA Bits

extern __at(0x0EED) __sfr PSMC3FFA;

typedef union
  {
  struct
    {
    unsigned PSMC3FFA0          : 1;
    unsigned PSMC3FFA1          : 1;
    unsigned PSMC3FFA2          : 1;
    unsigned PSMC3FFA3          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PSMC3FFA           : 4;
    unsigned                    : 4;
    };
  } __PSMC3FFAbits_t;

extern __at(0x0EED) volatile __PSMC3FFAbits_t PSMC3FFAbits;

#define _PSMC3FFA0              0x01
#define _PSMC3FFA1              0x02
#define _PSMC3FFA2              0x04
#define _PSMC3FFA3              0x08

//==============================================================================


//==============================================================================
//        PSMC3STR0 Bits

extern __at(0x0EEE) __sfr PSMC3STR0;

typedef struct
  {
  unsigned P3STRA               : 1;
  unsigned P3STRB               : 1;
  unsigned P3STRC               : 1;
  unsigned P3STRD               : 1;
  unsigned P3STRE               : 1;
  unsigned P3STRF               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC3STR0bits_t;

extern __at(0x0EEE) volatile __PSMC3STR0bits_t PSMC3STR0bits;

#define _P3STRA                 0x01
#define _P3STRB                 0x02
#define _P3STRC                 0x04
#define _P3STRD                 0x08
#define _P3STRE                 0x10
#define _P3STRF                 0x20

//==============================================================================


//==============================================================================
//        PSMC3STR1 Bits

extern __at(0x0EEF) __sfr PSMC3STR1;

typedef struct
  {
  unsigned P3HSMEN              : 1;
  unsigned P3LSMEN              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3SSYNC              : 1;
  } __PSMC3STR1bits_t;

extern __at(0x0EEF) volatile __PSMC3STR1bits_t PSMC3STR1bits;

#define _P3HSMEN                0x01
#define _P3LSMEN                0x02
#define _P3SSYNC                0x80

//==============================================================================


//==============================================================================
//        PSMC4CON Bits

extern __at(0x0F11) __sfr PSMC4CON;

typedef union
  {
  struct
    {
    unsigned P4MODE0            : 1;
    unsigned P4MODE1            : 1;
    unsigned P4MODE2            : 1;
    unsigned P4MODE3            : 1;
    unsigned P4DBRE             : 1;
    unsigned P4DBFE             : 1;
    unsigned PSMC4LD            : 1;
    unsigned PSMC4EN            : 1;
    };

  struct
    {
    unsigned P4MODE             : 4;
    unsigned                    : 4;
    };
  } __PSMC4CONbits_t;

extern __at(0x0F11) volatile __PSMC4CONbits_t PSMC4CONbits;

#define _P4MODE0                0x01
#define _P4MODE1                0x02
#define _P4MODE2                0x04
#define _P4MODE3                0x08
#define _P4DBRE                 0x10
#define _P4DBFE                 0x20
#define _PSMC4LD                0x40
#define _PSMC4EN                0x80

//==============================================================================


//==============================================================================
//        PSMC4MDL Bits

extern __at(0x0F12) __sfr PSMC4MDL;

typedef union
  {
  struct
    {
    unsigned P4MSRC0            : 1;
    unsigned P4MSRC1            : 1;
    unsigned P4MSRC2            : 1;
    unsigned P4MSRC3            : 1;
    unsigned                    : 1;
    unsigned P4MDLBIT           : 1;
    unsigned P4MDLPOL           : 1;
    unsigned P4MDLEN            : 1;
    };

  struct
    {
    unsigned P4MSRC             : 4;
    unsigned                    : 4;
    };
  } __PSMC4MDLbits_t;

extern __at(0x0F12) volatile __PSMC4MDLbits_t PSMC4MDLbits;

#define _P4MSRC0                0x01
#define _P4MSRC1                0x02
#define _P4MSRC2                0x04
#define _P4MSRC3                0x08
#define _P4MDLBIT               0x20
#define _P4MDLPOL               0x40
#define _P4MDLEN                0x80

//==============================================================================


//==============================================================================
//        PSMC4SYNC Bits

extern __at(0x0F13) __sfr PSMC4SYNC;

typedef union
  {
  struct
    {
    unsigned P4SYNC0            : 1;
    unsigned P4SYNC1            : 1;
    unsigned P4SYNC2            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P4DCPOL            : 1;
    unsigned P4PRPOL            : 1;
    unsigned P4POFST            : 1;
    };

  struct
    {
    unsigned P4SYNC             : 3;
    unsigned                    : 5;
    };
  } __PSMC4SYNCbits_t;

extern __at(0x0F13) volatile __PSMC4SYNCbits_t PSMC4SYNCbits;

